{
    "mission": "To accumulate and culminate the highest quality free resources found online, in an organized and easy to use manner.",
    "vision": "Freesource Library is dedicated to providing access to the knowledge and tools needed to learn how to live.",
    "importance": "This site is meant to help others have easy access to the knowledge and tools they need to learn how to live the life they want to live.",
    "how": "I was lucky enough to do an informational interview with Steve Cashdollar, author of the book Simple Courage, and he helped me gain a better insight of how I could help others. I was introduced to his book and his work through someone that was able to recieve his life coaching through some of his volunteer work. I knew he had a long history of working with people who have nothing, who are coming from bad situations, people that don't even know what help they need or how to get it. I've always had a passion for helping others, and I've always had a passion for making things. Figuring out how to combine those into my own unique brand of software developement and ultimately creating a business where I make things that help people. I asked Steve \"What are the biggest things that hold people back that could be relieved through thoughtful automation?\", and gave the example of an app that could give medication reminders. Steve thought about my question for a moment then gave me an aswer that helped me put everything into perspective. He told me \"The biggest thing holding back the people I've worked with is not knowing how to live.\", and explained that people have such diverse backgrounds but many people enter adulthood never having been taught about or how to do so many crucial things including basic life skills. He told me to pick one way I love to help people, some niche that I really love, and figure out within that what I can automate. The Freesource Library is the first project that allows me to use my software engineering skills and my professional researching skills to create an application that puts valuable resources directly into the hands to the user without the stress of any financial burden.",
    "thanks": "Thank you so much for visiting this site! I hope you found a resource that was beneficial to you!",
    "author": "Kaye B."
}